; domain
;; Wumpus domain

(define (domain wumpus-c)
  (:requirements :strips )
  (:predicates
   (at ?what ?square) 
   (adj-north ?square1 ?square2)
   (adj-south ?square1 ?square2)
   (adj-west ?square1 ?square2)
   (adj-east ?square1 ?square2)
   (pit ?square)
   (wumpus-in ?square)
     ;; <-> (exists ?x (and (is-wumpus ?x) (at ?x ?square) (not (dead ?x))
   (have ?who ?what)
   (is-agent ?who)
   (is-wumpus ?who)
   (is-gold ?what)
   (is-arrow ?what)
   (dead ?who)
   (origin ?square)
   (direction-north ?who)
   (direction-south ?who)
   (direction-east ?who)
   (direction-west ?who)
   (hasRotatedYet)
   (hasClimbed) 
   
   )
  
  (:functions 
   (total-cost) - number
   )
  
  ;Function for moving agent north
  (:action move-agent-north
    :parameters (?who ?from ?to)
    :precondition (and (is-agent ?who)
		       (at ?who ?from)
		       (not (pit ?to))
		       (not (wumpus-in ?to))
		       (adj-north ?from ?to)
		       (direction-north ?who)
		       )
    :effect (and (not (at ?who ?from))
		 (at ?who ?to)
		 (increase (total-cost) 1)
		 )
    )
  
    
  (:action move-agent-south
    :parameters (?who ?from ?to)
    :precondition (and (is-agent ?who)
		       (at ?who ?from)
		       (not (pit ?to))
		       (not (wumpus-in ?to))		       
		       (adj-south ?from ?to)
		       (direction-south ?who)
		       )
    :effect (and (not (at ?who ?from))
		 (at ?who ?to)
		 (increase (total-cost) 1)
		 )
    )
    
  (:action move-agent-east
    :parameters (?who ?from ?to)
    :precondition (and (is-agent ?who)
		       (at ?who ?from) 
		       (not (pit ?to))
		       (not (wumpus-in ?to))		       
		       (adj-east ?from ?to)
		       (direction-east ?who) 
		       )
    :effect (and (not (at ?who ?from))
		 (at ?who ?to)
		 (increase (total-cost) 1)
		 )
    )
  
  (:action move-agent-west
    :parameters (?who ?from ?to)
    :precondition (and (is-agent ?who)
		       (at ?who ?from) 
		       (not (pit ?to))
		       (not (wumpus-in ?to))		       
		       (adj-west ?from ?to)
		       (direction-west ?who) 
		       )
    :effect (and (not (at ?who ?from))
		 (at ?who ?to)
		 (increase (total-cost) 1)
		 )
    )
  
  (:action climb-action-init
      :parameters (?who ?origin-sq)
     :precondition (and (at ?who ?origin-sq) (is-agent ?who) (origin ?origin-sq) )
	  :effect (and (increase (total-cost) 1000) (hasClimbed))
  )
  
  (:action climb-action-with-gold
      :parameters (?who ?origin-sq ?the-gold)
      :precondition (and 
           (is-agent ?who)
		       (have ?who ?the-gold)
		       (is-gold ?the-gold)
		       (at ?who ?origin-sq)
		       (origin ?origin-sq)
		       )
		       
      :effect (and (increase (total-cost) 1) (hasClimbed) )
  )
  
  (:action rotate-right
      :parameters (?who)
      :precondition (and (is-agent ?who))
      :effect (and
      (not(hasRotatedYet))
      (when
        (direction-north ?who)
        (and(not(direction-north ?who))(direction-east ?who)(hasRotatedYet))
      )
      (when
        (and(direction-east ?who)(not(hasRotatedYet)))
        (and(not(direction-east ?who))(direction-south ?who)(hasRotatedYet))
      )
      (when
        (and(direction-south ?who)(not(hasRotatedYet)))
        (and(not(direction-south ?who))(direction-west ?who)(hasRotatedYet))
      )
      (when
        (and(direction-west ?who)(not(hasRotatedYet)))
        (and(not(direction-west ?who))(direction-north ?who)(hasRotatedYet))
      )
      (increase (total-cost) 1)
      )
  )

  (:action rotate-left
      :parameters (?who)
      :precondition (and (is-agent ?who))
      :effect (and
      (not(hasRotatedYet))
      (when
        (direction-north ?who)
        (and(not(direction-north ?who))(direction-west ?who)(hasRotatedYet))
      )
      (when
        (and(direction-west ?who)(not(hasRotatedYet)))
        (and(not(direction-west ?who))(direction-south ?who)(hasRotatedYet))
      )
      (when
        (and(direction-south ?who)(not(hasRotatedYet)))
        (and(not(direction-south ?who))(direction-east ?who)(hasRotatedYet))
      )
      (when
        (and(direction-east ?who)(not(hasRotatedYet)))
        (and(not(direction-east ?who))(direction-north ?who)(hasRotatedYet))
      )
      (increase (total-cost) 1)
      )
  )
  
  (:action take
    :parameters (?who ?what ?where)
    :precondition (and (is-agent ?who)
		       (at ?who ?where)
		       (at ?what ?where)
		       (is-gold ?what)
		       )
    :effect (and (have ?who ?what)
		 (not (at ?what ?where))
		 (increase (total-cost) 1)
		 )
    )

  (:action shoot_N
    :parameters (?who ?where ?with-what ?victim ?where-victim)
    :precondition (and (is-agent ?who)
		       (have ?who ?with-what)
		       (is-arrow ?with-what)
		       (at ?who ?where)
		       (is-wumpus ?victim)
		       (at ?victim ?where-victim)
		       (adj-north ?where ?where-victim)
		       )
    :effect (
         and (dead ?victim)
		 (not (wumpus-in ?where-victim))
		 (not (have ?who ?with-what))
		 (increase (total-cost) 10)
		 )
    )
    (:action shoot_E
    :parameters (?who ?where ?with-what ?victim ?where-victim)
    :precondition (and (is-agent ?who)
		       (have ?who ?with-what)
		       (is-arrow ?with-what)
		       (at ?who ?where)
		       (is-wumpus ?victim)
		       (at ?victim ?where-victim)
		       (adj-east ?where ?where-victim)
		       )
    :effect (
         and (dead ?victim)
		 (not (wumpus-in ?where-victim))
		 (not (have ?who ?with-what))
		 (increase (total-cost) 10)
		 )
    )
    (:action shoot_W
    :parameters (?who ?where ?with-what ?victim ?where-victim)
    :precondition (and (is-agent ?who)
		       (have ?who ?with-what)
		       (is-arrow ?with-what)
		       (at ?who ?where)
		       (is-wumpus ?victim)
		       (at ?victim ?where-victim)
		       (adj-west ?where ?where-victim)
		       )
    :effect (
         and (dead ?victim)
		 (not (wumpus-in ?where-victim))
		 (not (have ?who ?with-what))
		 (increase (total-cost) 10)
		 )
    )
    (:action shoot_S
    :parameters (?who ?where ?with-what ?victim ?where-victim)
    :precondition (and (is-agent ?who)
		       (have ?who ?with-what)
		       (is-arrow ?with-what)
		       (at ?who ?where)
		       (is-wumpus ?victim)
		       (at ?victim ?where-victim)
		       (adj-south ?where ?where-victim)
		       )
    :effect (
         and (dead ?victim)
		 (not (wumpus-in ?where-victim))
		 (not (have ?who ?with-what))
		 (increase (total-cost) 10)
		 )
    )  
)

; problem
(define (problem wumpus-c-1-4x4)
  (:domain wumpus-c)
  (:objects sq-1-1 sq-1-2 sq-1-3 sq-1-4
	    sq-2-1 sq-2-2 sq-2-3 sq-2-4
	    sq-3-1 sq-3-2 sq-3-3 sq-3-4
	    sq-4-1 sq-4-2 sq-4-3 sq-4-4
	    the-gold the-arrow
	    agent wumpus)
  (:init 

	(adj-east sq-1-1 sq-2-1)
	(adj-east sq-1-2 sq-2-2)
	(adj-east sq-1-3 sq-2-3)
	(adj-east sq-1-4 sq-2-4)
	(adj-east sq-2-1 sq-3-1)	
	(adj-east sq-2-2 sq-3-2)
	(adj-east sq-2-3 sq-3-3)
	(adj-east sq-2-4 sq-3-4)
	(adj-east sq-3-1 sq-4-1)	
	(adj-east sq-3-2 sq-4-2)
	(adj-east sq-3-3 sq-4-3)
	(adj-east sq-3-4 sq-4-4)

	(adj-west sq-2-1 sq-1-1)
	(adj-west sq-2-2 sq-1-2)
	(adj-west sq-2-3 sq-1-3)
	(adj-west sq-2-4 sq-1-4)
	(adj-west sq-3-1 sq-2-1)	
	(adj-west sq-3-2 sq-2-2)
	(adj-west sq-3-3 sq-2-3)
	(adj-west sq-3-4 sq-2-4)
	(adj-west sq-4-1 sq-3-1)	
	(adj-west sq-4-2 sq-3-2)
	(adj-west sq-4-3 sq-3-3)
	(adj-west sq-4-4 sq-3-4)

	(adj-south sq-1-2 sq-1-1)
	(adj-south sq-1-3 sq-1-2)	
	(adj-south sq-1-4 sq-1-3)
	(adj-south sq-2-2 sq-2-1)
	(adj-south sq-2-3 sq-2-2)
	(adj-south sq-2-4 sq-2-3)
	(adj-south sq-3-2 sq-3-1)
	(adj-south sq-3-3 sq-3-2)
	(adj-south sq-3-4 sq-3-3)
	(adj-south sq-4-2 sq-4-1)
	(adj-south sq-4-3 sq-4-2)
	(adj-south sq-4-4 sq-4-3)
	
	(adj-north sq-1-1 sq-1-2)
	(adj-north sq-1-2 sq-1-3)
	(adj-north sq-1-3 sq-1-4)
	(adj-north sq-2-1 sq-2-2)
	(adj-north sq-2-2 sq-2-3)
	(adj-north sq-2-3 sq-2-4)
	(adj-north sq-3-1 sq-3-2)
	(adj-north sq-3-2 sq-3-3)
	(adj-north sq-3-3 sq-3-4)
	(adj-north sq-4-1 sq-4-2)
	(adj-north sq-4-2 sq-4-3)
	(adj-north sq-4-3 sq-4-4)
	
	 (pit sq-1-2)
	 (is-gold the-gold)
	 (at the-gold sq-1-4)
	 (is-agent agent)
	 (at agent sq-1-1)
	 (is-arrow the-arrow)
	 (have agent the-arrow)
	 (is-wumpus wumpus)
	 (at wumpus sq-2-2)
	 (wumpus-in sq-2-2)
	 (origin sq-1-1)
	 (= (total-cost) 0)
	 (direction-north agent)
    
    )
  
  (:goal (and (hasClimbed) (have agent the-gold) (at agent sq-1-1)))
  (:metric minimize (total-cost))
  )

; plan
1. (climb-action-init agent sq-1-1)
   added: (hasclimbed)
   goals met: 2 of 3
2. (rotate-right agent)
   deleted: (direction-north agent)
   added: (direction-east agent) (hasrotatedyet)
   goals met: 2 of 3
3. (rotate-left agent)
   deleted: (hasrotatedyet)
   goals met: 2 of 3
4. (move-agent-east agent sq-1-1 sq-2-1)
   deleted: (at agent sq-1-1)
   added: (at agent sq-2-1)
   goals met: 1 of 3
5. (rotate-left agent)
   deleted: (direction-east agent)
   added: (direction-north agent) (hasrotatedyet)
   goals met: 1 of 3
6. (shoot_n agent sq-2-1 the-arrow wumpus sq-2-2)
   deleted: (wumpus-in sq-2-2) (have agent the-arrow)
   added: (dead wumpus)
   goals met: 1 of 3
7. (move-agent-north agent sq-2-1 sq-2-2)
   deleted: (at agent sq-2-1)
   added: (at agent sq-2-2)
   goals met: 1 of 3
8. (move-agent-north agent sq-2-2 sq-2-3)
   deleted: (at agent sq-2-2)
   added: (at agent sq-2-3)
   goals met: 1 of 3
9. (move-agent-north agent sq-2-3 sq-2-4)
   deleted: (at agent sq-2-3)
   added: (at agent sq-2-4)
   goals met: 1 of 3
10. (rotate-left agent)
   deleted: (direction-north agent)
   added: (direction-west agent)
   goals met: 1 of 3
11. (rotate-left agent)
   deleted: (hasrotatedyet)
   goals met: 1 of 3
12. (move-agent-west agent sq-2-4 sq-1-4)
   deleted: (at agent sq-2-4)
   added: (at agent sq-1-4)
   goals met: 1 of 3
13. (rotate-left agent)
   deleted: (direction-west agent)
   added: (direction-south agent) (hasrotatedyet)
   goals met: 1 of 3
14. (rotate-left agent)
   deleted: (hasrotatedyet)
   goals met: 1 of 3
15. (take agent the-gold sq-1-4)
   deleted: (at the-gold sq-1-4)
   added: (have agent the-gold)
   goals met: 2 of 3
16. (move-agent-south agent sq-1-4 sq-1-3)
   deleted: (at agent sq-1-4)
   added: (at agent sq-1-3)
   goals met: 2 of 3
17. (rotate-left agent)
   deleted: (direction-south agent)
   added: (direction-east agent) (hasrotatedyet)
   goals met: 2 of 3
18. (rotate-left agent)
   deleted: (hasrotatedyet)
   goals met: 2 of 3
19. (move-agent-east agent sq-1-3 sq-2-3)
   deleted: (at agent sq-1-3)
   added: (at agent sq-2-3)
   goals met: 2 of 3
20. (rotate-right agent)
   deleted: (direction-east agent)
   added: (direction-south agent) (hasrotatedyet)
   goals met: 2 of 3
21. (rotate-left agent)
   deleted: (hasrotatedyet)
   goals met: 2 of 3
22. (move-agent-south agent sq-2-3 sq-2-2)
   deleted: (at agent sq-2-3)
   added: (at agent sq-2-2)
   goals met: 2 of 3
23. (move-agent-south agent sq-2-2 sq-2-1)
   deleted: (at agent sq-2-2)
   added: (at agent sq-2-1)
   goals met: 2 of 3
24. (rotate-right agent)
   deleted: (direction-south agent)
   added: (direction-west agent) (hasrotatedyet)
   goals met: 2 of 3
25. (move-agent-west agent sq-2-1 sq-1-1)
   deleted: (at agent sq-2-1)
   added: (at agent sq-1-1)
   goals met: 3 of 3
